Tekla.Structures.Plugins.DirectManipulation.Internal.Features.DirectManipulationApiFeatureBase
The Tekla.Structures.Plugins.DirectManipulation.Internal.Features.DirectManipulationApiFeatureBase class is the base class for DM features with a set of services.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.DirectManipulationApiFeatureBase.useFeatureContextualToolbar
The value indicating whether to use the feature contextual toolbar.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.DirectManipulationApiFeatureBase.#ctor(System.Boolean)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Internal.Features.DirectManipulationApiFeatureBase class.
useFeatureContextualToolBar:
The System.Boolean value to indicate whether the feature level contextual toolbar should be used.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.DirectManipulationApiFeatureBase.Graphics
Gets the graphics service.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.DirectManipulationApiFeatureBase.HandleManager
Gets the handle manager.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.DirectManipulationApiFeatureBase.Connection
Gets the connection.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.DirectManipulationApiFeatureBase.OnActivated(Tekla.BIM.DirectManipulation.Features.FeatureActivationEventArgs)


Tekla.Structures.Plugins.DirectManipulation.Internal.Features.DirectManipulationApiFeatureBase.OnRefreshSuggested(Tekla.BIM.DirectManipulation.Features.FeatureActivationEventArgs)


Tekla.Structures.Plugins.DirectManipulation.Internal.Features.DirectManipulationApiFeatureBase.DefineFeatureContextualToolbar(Tekla.Structures.Plugins.DirectManipulation.Core.IToolbar)
Sets the contextual toolbar for the feature.
toolbar: The toolbar.

Tekla.Structures.Plugins.DirectManipulation.Internal.Features.DirectManipulationApiFeatureBase.InitializeResources(Tekla.BIM.DirectManipulation.Features.FeatureActivationEventArgs)
Initializes the resources of the feature base.
eventArgs: The Tekla.BIM.DirectManipulation.Features.FeatureActivationEventArgs instance containing the event data.